app/controllers/textbooks_controller.rb

SELECT "textbooks".* FROM "textbooks"
---
  def index
    @textbooks = Textbook.all

INSERT INTO "textbooks" ("title", "department", "price", "offer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Calculus"], ["department", "MATH"], ["price", 100], ["offer", "t"], ["created_at", "2016-04-07 03:08:25.289646"], ["updated_at", "2016-04-07 03:08:25.289646"]]
---
  def create
    @textbook = Textbook.new(textbook_params)

    respond_to do |format|
      if @textbook.save

UPDATE "textbooks" SET "price" = ?, "updated_at" = ? WHERE "textbooks"."id" = ?  [["price", 12312112], ["updated_at", "2016-04-07 05:04:42.141424"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @textbook.update(textbook_params)

DELETE FROM "textbooks" WHERE "textbooks"."id" = ?  [["id", 1]]
---
  def destroy
    @textbook.destroy

SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_textbook
      @textbook = Textbook.find(params[:id])